Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/edc/PIC32MZ1024EFF124.PIC
      <edc:AdjustPoint edc:_addr="0x1F8100B0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F8100C0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIE" edc:desc="" edc:mask="0x1" edc:name="IC5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIE" edc:desc="" edc:mask="0x1" edc:name="IC6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IE" edc:desc="" edc:mask="0x1" edc:name="IC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IE" edc:desc="" edc:mask="0x1" edc:name="OC6IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100D0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000u00000000000000000000000000" edc:name="IEC1" edc:nzwidth="32" edc:por="00000x00000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IE" edc:desc="" edc:mask="0x1" edc:name="T7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIE" edc:desc="" edc:mask="0x1" edc:name="IC7EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IE" edc:desc="" edc:mask="0x1" edc:name="IC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IE" edc:desc="" edc:mask="0x1" edc:name="OC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IE" edc:desc="" edc:mask="0x1" edc:name="T8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIE" edc:desc="" edc:mask="0x1" edc:name="IC8EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IE" edc:desc="" edc:mask="0x1" edc:name="IC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IE" edc:desc="" edc:mask="0x1" edc:name="OC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IE" edc:desc="" edc:mask="0x1" edc:name="T9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIE" edc:desc="" edc:mask="0x1" edc:name="IC9EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IE" edc:desc="" edc:mask="0x1" edc:name="IC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IE" edc:desc="" edc:mask="0x1" edc:name="OC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIE" edc:desc="" edc:mask="0x1" edc:name="ADCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFIFOIE" edc:mask="0x1" edc:name="ADCFIFOIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC3IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF5IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIE" edc:mask="0x1" edc:name="ADCFLTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IE" edc:desc="" edc:mask="0x1" edc:name="ADCD0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IE" edc:desc="" edc:mask="0x1" edc:name="ADCD1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IE" edc:desc="" edc:mask="0x1" edc:name="ADCD2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IE" edc:desc="" edc:mask="0x1" edc:name="ADCD3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IE" edc:desc="" edc:mask="0x1" edc:name="ADCD4IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
